uat_chat/InformationRegisters/Подписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Подписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>уатСотрудники</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/Подписи/Ext/ManagerModule.bsl
Функция ПолучитьТаблицуПодписей(Обк,Контрагент=Неопределено) Экспорт
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подписи.Объект,
	               |	Подписи.Контрагент,
	               |	Подписи.уатСотрудники Сотрудник
	               |ИЗ
	               |	РегистрСведений.Подписи КАК Подписи
	               |ГДЕ
	               |	Подписи.Объект = &Объект
	               |	И Подписи.Контрагент = &Контрагент 
				   |";
				   
				   Запрос.УстановитьПараметр("Объект",Обк.Метаданные().ПолноеИмя());
				   Запрос.УстановитьПараметр("Контрагент",Контрагент);
				   
				   Тбл = Запрос.Выполнить().Выгрузить();
				   Если Тбл.Количество()=0 Тогда
					   Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Подписи.Контрагент = &Контрагент","");
					   Тбл = Запрос.Выполнить().Выгрузить();
				   КонецеСЛИ;
				   
	Возврат Тбл;			   
	
КонецФункции
